---
kind: other
id: Methods.T:Autodesk.Revit.DB.FamilySizeTableManager
source: html/87250a12-a7ed-ee80-d873-85f50909b477.htm
---
# FamilySizeTableManager Methods

Adds FamilySizeTableManager to a Family.
 A FamilySizeTableManager and FamilySizeTables are only needed when
 importing, exporting, or removing size data previously stored in CSV files.